

function showTextAll(){
    showText(cat, 92.351931,29.830882, "2.1：米拉山", "米拉山", "米拉山因其高大雄奇而成为此地藏民心目中的神山，山口上挂着大片壮观的风马旗，地上遍布着抛洒的印有经文的隆达纸。\n" +
        "\n" +
        "海拔5018米的米拉山口，俗称“芒雄拉”，译为“红谷山”，是拉萨市与林芝市的分界山口，东距林芝地区政治经济文化中心八一镇248公里，西离自治区首府拉萨158公里。\n" +
        "\n" +
        "米拉山口，即西藏米拉山的山口，地处拉萨市到墨竹工卡县与林芝地区工布江达县的分界上，这里是拉萨——林芝旅游线上的一个休憩之地。");

    showText(cat, 94.472429,29.457249, "2.2/3.2：尼洋河风光带", "尼洋河风光带", "尼洋河，中国青藏高原上的河流，全长307.5公里，流域面积1.75万平方公里，在雅鲁藏布江众支流中排行第四，但水量丰足，仅次于帕隆藏布江。\n" +
        "尼洋河发源于中国西藏自治区米拉山西侧的错木梁拉，由西向东流，在林芝县的则们附近汇入雅鲁藏布江。 [1] \n" +
        "尼洋河是西藏自治区工布地区的“母亲河”，又称“娘曲”，藏语意为“神女的眼泪”。尼洋河沿河两岸植被完好，风光旖旎，景色迷人，途径景点众多，是青藏高原的河流之一。尼洋河风光带野生鸟类众多，这里也是西藏著名的黑颈鹤越冬区。");

    showText(cat, 93.868296,29.988233, "2.3：巴松措", "巴松措", "巴松措又名措高湖，藏语中是“绿色的水”的意思，长约18公里，湖面面积约27平方公里，最深处达120米，湖面海拔3480米。 [1]  位于距工布江达县巴河镇约36千米的巴河上游的高峡深谷里，是红教的一处著名神湖和圣地。\n" +
        "巴松措在1994年被评为国家风景名胜区，同时被世界旅游组织列入世界旅游景区（点），2000年被国家旅游局评为全国首批国家4A级景区,2001年被国家林业部授予国家森林公园称号。\n" +
        "2017年8月，成为西藏首个也是唯一的自然风景类国家5A级旅游风景区。");

    showText(cat, 94.366815,29.645155, "2.4：八一镇", "八一镇", "西藏自治区林芝市巴宜区辖镇，林芝市政府驻地，是林芝市政治、经济、文化中心。\n" +
        "曾是一片乱石滩，解放军到此地之后，开始建设，因此叫八一镇。\n" +
        "位于西藏林芝市巴宜区中部尼洋河畔，东南邻林芝镇，西邻更章门巴民族乡，南邻布久乡。镇政府驻地海拔2900米。\n" +
        "属高原性气候的亚热带气候。\n" +
        "全镇面积1291.52平方千米。\n" +
        "2017年，共有48733人。\n" +
        "是西藏重要的交通枢纽，318国道、拉林高等级公路、省道306通过八一镇。\n" +
        "八一镇被列为第二批国家新型城镇化综合试点地区。");

    showText(cat, 94.704572,29.619418, "3.1：鲁朗林海", "鲁朗林海", "鲁朗藏语意为“龙王谷”，位于被誉为“雪域瑞士” 的西藏林芝地区林芝县鲁朗镇境内，距八一镇80公里左右的川藏公路南路（318国道）上，座落在深山老林之中，处于雅鲁藏布江大峡谷涌入的印度洋水气带，海拔2700－4200米属高原温暖半湿润气候，素有“西藏江南”美称。\n" +
        "鲁朗林海是一处云山雾海里的森林，有“叫人不想家的”的美誉，整个景点如诗如画，周边雪山林立，沟内森林葱笼，林间还有整齐如人工修剪般的草甸，许多民居修建在这山环水复的天上森林，周边溪流蜿蜒，有成千上万种野花竞相开放，简直就是人间天堂。");

    showText(cat, 94.944433,29.619023, "3.3：雅鲁藏布江大峡谷", "雅鲁藏布江大峡谷", "是中国最长的高原河流，位于西藏自治区境内，也是世界上海拔最高的大河之一。发源于西藏西南部喜马拉雅山北麓的杰马央宗冰川，上游称为马泉河，由西向东横贯西藏南部，绕过喜马拉雅山脉最东端的南迦巴瓦峰转向南流，经巴昔卡出中国境。水能蕴藏量丰富，在中国仅次于长江。雅鲁藏布江大拐弯处的雅鲁藏布江大峡谷是世界第一大峡谷，获得中国世界纪录协会的世界最深大峡谷、世界最长大峡谷两项世界纪录的认证。");

    showText(cat, 94.899233,29.579823, "3.4：索松村", "索松村", "索松村是西藏自治区林芝市米林县派镇下辖自然村。\n" +
        "\n" +
        "2017年12月，索松村自然村有39户173人。 [3-4] \n" +
        "2018年11月，全行政村共114户413人。\n" +
        "2017年，索松村有建档立卡贫困户4户，五保户2户。除传统农牧业、林下资源采集外，旅游业是索松村农牧民的重要经济来源，全村共有30家家庭旅馆，床位近1000张。\n" +
        "2017年，实施派镇索松村小康示范村建设项目， [5]  免费WiFi已覆盖索松村。\n" +
        "索松村位于雅鲁藏布大峡谷景区内，有成片的桃林，是拍摄南迦巴瓦峰和桃花的好位置。");

    showText(cat, 95.062379,29.634847, "4.1：南迦巴瓦峰", "南迦巴瓦峰", "南迦巴瓦峰，地处喜马拉雅山脉、念青唐古拉山脉和横断山脉的交会处，是中国西藏自治区林芝市最高的山，海拔7782米，属于喜马拉雅山脉，位于喜马拉雅山脉最东端。\n" +
        "它是西藏最古老的佛教“雍仲本教”的圣地，有“西藏众山之父”之称。同时，紧邻着的雅鲁藏布大峡谷绕着他转了一个马蹄形的弯，随后通向印度洋方向延伸出去。南迦巴瓦峰别称“木卓巴尔山”，其巨大的三角形峰体终年积雪，云雾缭绕，从不轻易露出真面目，所以它也被称为“羞女峰”。南迦巴瓦在藏语中有多种解释，一为“雷电如火燃烧”，一为“直刺天空的长矛'，还有一为“天山掉下来的石头”。后一个名字来源于《格萨尔王传》中的“门岭一战”，在这段中将南迦巴瓦峰描绘成“状若长矛，直刺苍穹”。");

    showText(cat, 92.698827,29.54465, "4.2：拉姆拉措", "拉姆拉措", "拉姆拉措是西藏最具传奇色彩的湖泊。“拉姆”意为仙女、女神，“拉”意为湖面，“拉姆拉错”藏语意为“吉祥天姆湖”、“圣姆湖”。 又名琼果杰神湖，在加查县曲科杰丛山之中，海拔4000米以上。\n" +
        "在寻找达赖喇嘛的转世灵童时，圣僧们也会到湖边去寻找指示。\n" +
        "拉姆拉措在藏语中的意思是“天女之魂湖”，湖面积虽然不大，但在藏传佛教转世制度中，它有着特殊地位，因尔备受信徒们敬仰，每年寻访达赖喇嘛、班禅等大活佛的转世灵童前，都要到此观湖下相。每年藏历四至六月，许多善男信女前来这里朝圣观景。据说多人同观，所见各异，据说可以从湖水的倒影中看到自己的未来。明正德四年（1509年）达赖二世根敦嘉措在附近修建了琼果杰寺，为高原奇特风光增添景色。每当寻访达赖喇嘛、班禅额尔德尼等大活佛的转世灵童之前，都要到此观湖卜相，以受神示，而且每世达赖喇嘛都要到“神湖”朝拜一次。据说朝拜此湖的有缘之人还可从湖水幻示的影像中看出神喻的前生和来世。神湖能呈现每一个去朝拜神湖的人未来的命运，只要虔诚地向湖中凝望，圣湖就能为朝圣者显示出未来的各种景象。西藏历代达赖喇嘛和班禅的转世灵童，都是通过观神湖所现的异象确定寻访的方向和原则的，而且该湖也是无数善男信女探求自己命运的宝镜。");

    showText(cat, 91.769427,29.231148, "4.3：泽当", "泽当", "旧镇名。详见泽当街道。原泽当镇，属于西藏自治区山南市乃东区，距拉萨191千米，距贡嘎机场87千米。是山南市和乃东区政治、经济、文化和交通的中心。\n" +
        "泽当镇在地理上位于雅砻河与雅鲁藏布江汇流处东侧，属山南市乃东区，为山南市人民政府所在地，海拔3560米。\n" +
        "泽当镇年均温度8℃—9℃，最热月均温15.7℃。年降水302毫米，太阳辐射强，日照时间长。 [1] \n" +
        "泽当镇被列为第二批国家新型城镇化综合试点地区。");

    showText(cat, 91.510483,29.329299, "5.1：桑耶寺", "桑耶寺", "桑耶寺又名存想寺、无边寺，位于西藏自治区山南地区的扎囊县桑耶镇境内，雅鲁藏布江北岸的哈布山下。\n" +
        "桑耶寺始建于公元8世纪吐蕃王朝时期，是西藏第一座剃度僧人出家的寺院。寺内建筑按佛教的宇宙观进行布局，中心佛殿兼具藏族、汉族、印度三种风格，因此桑耶寺也被称作三样寺。桑耶寺现有50多僧人。\n" +
        "1996年，桑耶寺被中华人民共和国国务院公布为第四批中国重点文物保护单位之一。2007年，桑耶寺被评定为国家AAAA级旅游景区。");

    showText(cat, 90.625883,29.197019, "5.2：羊湖", "羊湖", "羊卓雍措（YamdrokTso），有的人简称羊湖（并非藏北的羊湖），藏语意为“碧玉湖”，是西藏三大圣湖之一，像珊瑚枝一般，因此它在藏语中又被称为“上面的珊瑚湖”。\n" +
        "\n" +
        "羊卓雍措主要位于西藏山南市浪卡子县，中段在浪卡子县与贡嘎县之间，拉萨西南约70公里处，与纳木错、玛旁雍错并称西藏三大圣湖，是喜马拉雅山北麓最大的内陆湖泊，湖光山色之美，冠绝藏南。羊卓雍措面积675km²，湖面海拔4,441米。从拉萨到羊湖需要翻越5030米的岗巴拉山口。\n" +
        "湖西有宁金抗沙峰等三大雪峰。此峰高7206米，是后藏地区最重要的神山，也是西藏传统四大神山之一。另外，世界上海拔最高的抽水蓄能电站——羊湖电站即坐落于此。\n" +
        "\n" +
        "1996年，羊湖西岸发电站建成，是西藏最大的水利发电站，是世界上海拔最高的抽水蓄能电站。电站项目曾因生态原因遭到包括班禅额尔德尼·确吉坚赞和阿沛·阿旺晋美等的反对，后改为抽水蓄能电站以保持湖水水位。据估算，羊卓雍措的面积在按原计划开发后将减小，在开发67年后达到新平衡，而由封闭性湖泊转为开放型后，盐类流失将在1000年后达到新平衡。\n" +
        "\n" +
        "注意：羊湖与羊卓雍措有区别，搜索羊湖就进入羊卓雍措。其实，羊湖在西藏地图上标明的只有阿里地区北部靠近新疆的羊湖，有羊湖盆地。有的人简称羊卓雍措为羊湖，并非官方称呼，不能取代。");

    showText(cat, 90.172386,28.901845, "6.1：卡若拉冰川", "卡若拉冰川", "卡若拉冰川位于西藏山南地区浪卡子县和江孜县交界处，距离江孜县城约71公里， 是西藏三大大陆型冰川之一，为年楚河东部源头。\n" +
        "\n" +
        "途经西藏四大雪山之一的乃金岗桑。像一个静静梳妆的美人，卡若拉在群山之中脉脉远眺。据悉，在整个西藏离公路最近的就是卡若拉冰川，离公路只有三百多米。 卡若拉冰川位于浪卡子县和江孜县交界处，距离江孜县城71公里。乃金岗桑是拉轨岗日山的主峰，在喜马拉雅山以北。传说是藏传佛教四大山神—西方山神诺吉康娃桑布居住之地。乃金岗桑周围耸立着10余座6000米以上的山峰，是西藏四大雪山之一。\n" +
        "\n" +
        "卡若拉冰川背靠西藏四大高峰之一的乃钦康桑峰（7191米）南坡\n" +
        "\n" +
        "由于先后有电影《红河谷》、《江孜之战》、《云水谣》曾在此拍摄外景，使得卡若拉冰川的名气非常大，因此，很多旅行者都会在这里观赏冰川的壮观，赞叹大自然的魅力。 [1] \n" +
        "但是很可惜的是，由于《红河谷》拍摄时为了制造出真实的雪崩的情境，利用炸药在卡若拉冰川上炸出了一个三角形的缺口，游人可以在游览时清晰地看见。而卡若拉冰川作为著名的古冰川之一，这个缺口再也不会被补上。");




    showText(cat, 88.924744,29.227759, "6.2：日喀则", "日喀则", "日喀则，西藏自治区下辖地级市，位于中华人民共和国西南边陲，青藏高原西南部，西衔阿里地区、北靠那曲市、东邻拉萨市与山南市，外与尼泊尔、不丹、印度等国接壤；南北地势较高，其间为藏南高原和雅鲁藏布江流域。 [1]  辖1个市辖区和17个县。\n" +
        "日喀则的藏文意思是“土质最好的庄园”。\n" +
        "日喀则市境内定日县有世界第一高峰——珠穆朗玛峰。桑珠孜宗堡和江孜古堡都是曾经的政教中心。有扎什伦布寺、白居寺、萨迦寺等一批著名寺庙。有亚东口岸、樟木口岸和吉隆口岸。日喀则喜马南麓六大名沟被称为西藏小江南或西藏江南：亚东沟，陈塘沟，嘎玛沟，绒辖沟，樟木沟，吉隆沟。\n" +
        "2019年12月9日，经自治区人民政府研究，批准日喀则市谢通门县、江孜县、萨迦县、萨嘎县、拉孜县、南木林县退出贫困县（区）。 [2] \n" +
        "2019年，日喀则市地区生产总值279.49亿元，总人口87.07万人。\n" +
        "西藏第二大城市？但是人均GDP没有拉萨和林芝市高。。");

    showText(cat, 88.878545,29.271021, "7.1：扎什伦布寺", "扎什伦布寺", "扎什伦布寺是中国著名的六大黄教寺院之一。全国重点文物保护单位之一。 [1]  2017年8月，批准为国家5A级旅游景区。\n" +
        "\n" +
        "扎什伦布寺可与达赖的布达拉宫相媲美。它与拉萨的“三大寺”甘丹寺、色拉寺、哲蚌寺合称藏传佛教格鲁派的“四大寺”。四大寺以及青海的塔尔寺和甘肃的拉卜楞寺并列为格鲁派的“六大寺”。建筑结构也深刻影响了其他藏传佛教建筑如五当召。");
    showText(cat, 91.365009,31.02494, "7.2：藏北草原", "藏北草原", "藏北高原大草原是指西藏北部辽阔的高原，在那曲境内主要指羌塘大草原。 羌塘，是中国五大牧场之一，位于昆仑山脉、唐古拉山脉和冈底斯山脉之间，它不仅是野生动植物的天堂，同时也是一个具有丰厚沉积层的文化沃土。");
    showText(cat, 91.107639,30.479253, "7.3：当雄", "", "当雄（藏语意为“挑选的草场”），隶属于西藏自治区，位于中华人民共和国西藏自治区中部，藏南与藏北的交界地带，面积10036平方公里（2013年）\n" +
        "当雄县属高原大陆性气候，年日照时数2881小时。年降水量481毫米。8级以上大风年均可达74天。最多可达128天。主要自然灾害是雪灾，次为风灾、旱灾、虫灾、鼠灾等。\n" +
        "2014年1至6月，当雄县旅游收入1441万元，同比增长27.31%;接待游客145698人次，同比增长44.61%。 [1-2] \n" +
        "2018年10月，西藏自治区人民政府正式批准，当雄县退出贫困县（区）。");
    showText(cat, 90.493051,30.835017, "8.1：纳木错&圣象天门", "纳木错&圣象天门", "纳木错，位于西藏自治区中部，是西藏第二大湖泊，也是中国第三大的咸水湖。湖面海拔4718米，形状近似长方形，东西长70多千米，南北宽30多千米，面积约1920km²。 [1] \n" +
        "早期的科学考察认为，纳木错的最大深度为33米，但最近两年对湖泊的重新测量发现，纳木错最深处超过了120米。蓄水量768亿立方米，为世界上海拔最高的大型湖泊。 [2] \n" +
        "“纳木错”为藏语，蒙古语名称为“腾格里海”，都是“天湖”之意。纳木错是西藏的“三大圣湖”之一。 纳木措是古象雄佛法雍仲本教的第一神湖，为著名的佛教圣地之一。\n" +
        "\n" +
        "圣象天门 [1]  位于西藏那曲地区班戈县青龙乡5村境内 ，圣湖纳木措北部恰多朗卡岛上。\n" +
        "百度和高德等地图，地图搜出来在纳木措南岸扎西岛，实际上圣象天门在纳木错北岸。");
    showText(cat, 91.125038,29.660346, "8.2：布达拉宫", "布达拉宫", "布达拉宫（藏文：པོ་ཏ་ལ），坐落于中国西藏自治区的首府拉萨市区西北玛布日山上，是世界上海拔最高，集宫殿、城堡和寺院于一体的宏伟建筑，也是西藏最庞大、最完整的古代宫堡建筑群。\n" +
        "布达拉宫依山垒砌，群楼重叠，是藏式古建筑的杰出代表（据说源于桑珠孜宗堡），中华民族古建筑的精华之作，是第五套人民币50元纸币背面的风景图案 [1]  。主体建筑分为白宫和红宫两部分。主楼高117米 [2]  ，外观13层，内为9层。布达拉宫前辟有布达拉宫广场，是世界上海拔最高的城市广场。\n" +
        "\n" +
        "布达拉宫最初为吐蕃王朝赞普松赞干布为迎娶尺尊公主和文成公主而兴建。1645年（清顺治二年）清朝属国和硕特汗国时期护法王固始汗和格鲁派摄政者索南群培重建布达拉宫之后，成为历代达赖喇嘛冬宫居所，以及重大宗教和政治仪式举办地，也是供奉历世达赖喇嘛灵塔之地，旧时与驻藏大臣衙门共为统治中心。1\n" +
        "\n" +
        "布达拉宫是藏传佛教（格鲁派）的圣地，每年至此的朝圣者及旅游观光客不计其数。1961年3月，国务院列其为首批全国重点文物保护单位；1994年12月，联合国教科文组织列其为世界文化遗产；2013年1月，国家旅游局又列其为国家AAAAA级旅游景区。");
    showText(cat, 91.076985,29.627343, "1.1/8.3：拉萨", "拉萨", "拉萨，别称逻些、日光城，是中华人民共和国西藏自治区首府，国务院批复确定的中国具有雪域高原和民族特色的国际旅游城市 [1]  。截至2018年，全市下辖3个区、5个县，总面积29518平方千米，建成区面积82.82平方千米，常住人口约54.35万人，城镇人口约33万人，城镇化率46%。\n" +
        "拉萨地处中国西南地区、西藏高原中部、喜马拉雅山脉北侧、雅鲁藏布江支流拉萨河中游河谷平原，拉萨河流经此，在南郊注入雅鲁藏布江，是西藏的政治、经济、文化和科教中心，也是藏传佛教圣地。 [2]  海拔3650米，全年多晴朗天气，降雨稀少，冬无严寒，夏无酷暑，气候宜人。全年日照时间在3000小时以上，素有“日光城”的美誉。拉萨境内蕴藏着丰富的各类资源，相对于全国和自治区其他地市，具有较明显的资源优势。 [3] \n" +
        "拉萨是首批国家历史文化名城，拉萨以风光秀丽、历史悠久、风俗民情独特、宗教色彩浓厚而闻名于世。公元7世纪，松赞干布统一全藏，将政治中心从山南迁到拉萨。先后荣获中国优秀旅游城市、欧洲游客最喜爱的旅游城市、全国文明城市、中国最具安全感城市、中国特色魅力城市200强、世界特色魅力城市200强 [4]  、2018畅游中国100城 [5]  等荣誉称号。\n" +
        "2017年，拉萨复查确认继续保留全国文明城市荣誉称号。 [6]  2018年4月2日，科技部、国家发展改革委发布支持新一批城市开展创新型城市建设的名单，全国17座城市入选，拉萨名列其中。 [7]  2018年11月，入选中国城市全面小康指数前100名。 [8]");


}
